Revit 2027 API
FamilyThermalProperties.AnalyticConstructionTypeId Property
 The construction gbXML type. This value corresponds to the 'id' property of a constructionType node in Constructions.xml.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AnalyticConstructionTypeId { get; }
Public ReadOnly Property AnalyticConstructionTypeId As String
	Get
public:
property String^ AnalyticConstructionTypeId {
	String^ get ();
}
member AnalyticConstructionTypeId : string with get
Property Value
String
See Also
Reference
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace